In [23]:
import numpy as py
import pandas as pd

In [89]:
results = {
    'Rollno.' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name' : ['Craig', 'Harvey', 'Katy', 'Ryan', 'Danica', 'Sonia', 'Adriel', 'Michael', 'Ben', 'Angela'],
    'Gender' : ['Male', 'Male', 'Female', 'Male', 'Female', 'Female', 'Male', 'Male', 'Male', 'Female'],
    'Marks1' : [52, 85, 32, 56, 51, 74, 93, 60, 98, 89],
    'Marks2' : [51, 71, 82, 48, 86, 54, 21, 24, 33, 46],
    'Marks3' : [31, 63, 48, 39, 43, 82, 71, 42, 46, 68]
}

#Created a dataframe
df = pd.DataFrame(results)

In [91]:
df

   Rollno.     Name  Gender  Marks1  Marks2  Marks3
0        1    Craig    Male      52      51      31
1        2   Harvey    Male      85      71      63
2        3     Katy  Female      32      82      48
3        4     Ryan    Male      56      48      39
4        5   Danica  Female      51      86      43
5        6    Sonia  Female      74      54      82
6        7   Adriel    Male      93      21      71
7        8  Michael    Male      60      24      42
8        9      Ben    Male      98      33      46
9       10   Angela  Female      89      46      68

In [93]:
#Added a new column 'Total', which is the total marks
df['Total'] = df.iloc[: , 3:-1 ].sum(axis = 1)
df

   Rollno.     Name  Gender  Marks1  Marks2  Marks3  Total
0        1    Craig    Male      52      51      31    103
1        2   Harvey    Male      85      71      63    156
2        3     Katy  Female      32      82      48    114
3        4     Ryan    Male      56      48      39    104
4        5   Danica  Female      51      86      43    137
5        6    Sonia  Female      74      54      82    128
6        7   Adriel    Male      93      21      71    114
7        8  Michael    Male      60      24      42     84
8        9      Ben    Male      98      33      46    131
9       10   Angela  Female      89      46      68    135

In [95]:
#Finding the lowest marks in Marks1
lowest_marks1 = df['Marks1'].min()
lowest_marks1

32

In [97]:
#Finding the highest marks in Marks2
highest_marks2 = df['Marks2'].max()
highest_marks2

86

In [99]:
#Finding the average mark of Marks3
avg_marks3 = df['Marks3'].mean()
avg_marks3

53.3

In [101]:
#Higher average = Higher score
high_score = df['Total'].max()
high_score

156

In [103]:
df.loc[df['Total'] == high_score]

   Rollno.    Name Gender  Marks1  Marks2  Marks3  Total
1        2  Harvey   Male      85      71      63    156

In [105]:
#The person with the highest average
highest_scorer = df.loc[df['Total'] == high_score]['Name'].values[0]
highest_scorer

'Harvey'

In [107]:
#Finding the number of people who failed in Marks2
failed_marks2 = df.loc[df['Marks2'] < 40].shape[0]
failed_marks2

3

In [109]:
#5 - number summary of the numeric columns
df.iloc[: , 3:].describe()

          Marks1     Marks2     Marks3       Total
count  10.000000  10.000000  10.000000   10.000000
mean   69.000000  51.600000  53.300000  120.600000
std    21.934245  22.554625  16.546567   20.828399
min    32.000000  21.000000  31.000000   84.000000
25%    53.000000  36.250000  42.250000  106.500000
50%    67.000000  49.500000  47.000000  121.000000
75%    88.000000  66.750000  66.750000  134.000000
max    98.000000  86.000000  82.000000  156.000000